In [52]:
t = (1,2,3,4)

t[1:3]

(2, 3)

In [53]:
import pandas as pd

dictionary = {"name":["apo","yusuf","kaan","tayfun","aliş"],
             "age":[24,36,56,42,None],
             "note":[888,238,42,87654,None]}

dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

     name   age     note
0     apo  24.0    888.0
1   yusuf  36.0    238.0
2    kaan  56.0     42.0
3  tayfun  42.0  87654.0
4    aliş   NaN      NaN

In [54]:
head = dataframe1.head() 
print(head)

     name   age     note
0     apo  24.0    888.0
1   yusuf  36.0    238.0
2    kaan  56.0     42.0
3  tayfun  42.0  87654.0
4    aliş   NaN      NaN

In [55]:
tail = dataframe1.tail()
print(tail)

     name   age     note
0     apo  24.0    888.0
1   yusuf  36.0    238.0
2    kaan  56.0     42.0
3  tayfun  42.0  87654.0
4    aliş   NaN      NaN

In [56]:
print(dataframe1.columns)

Index(['name', 'age', 'note'], dtype='object')

In [57]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     4 non-null      float64
 2   note    4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 248.0+ bytes
None

In [58]:
print(dataframe1.dtypes)

name     object
age     float64
note    float64
dtype: object

In [59]:
print(dataframe1.describe())

             age          note
count   4.000000      4.000000
mean   39.500000  22205.500000
std    13.304135  43633.831473
min    24.000000     42.000000
25%    33.000000    189.000000
50%    39.000000    563.000000
75%    45.500000  22579.500000
max    56.000000  87654.000000

In [61]:
print(dataframe1["name"]) 
print(dataframe1.loc[:, "age"])                      
dataframe1["yeni_future"] = [1,2,3,4,5]
print(dataframe1.loc[:2,"age"]) 
print(dataframe1.loc[:2, "name":"note"])                 
print(dataframe1.loc[::-1])

0       apo
1     yusuf
2      kaan
3    tayfun
4      aliş
Name: name, dtype: object
0    24.0
1    36.0
2    56.0
3    42.0
4     NaN
Name: age, dtype: float64
0    24.0
1    36.0
2    56.0
Name: age, dtype: float64
    name   age   note
0    apo  24.0  888.0
1  yusuf  36.0  238.0
2   kaan  56.0   42.0
     name   age     note  yeni_future
4    aliş   NaN      NaN            5
3  tayfun  42.0  87654.0            4
2    kaan  56.0     42.0            3
1   yusuf  36.0    238.0            2
0     apo  24.0    888.0            1

In [62]:
print(dataframe1.yeni_future)

0    1
1    2
2    3
3    4
4    5
Name: yeni_future, dtype: int64

In [63]:
print(dataframe1.loc[:, "age"])

0    24.0
1    36.0
2    56.0
3    42.0
4     NaN
Name: age, dtype: float64

In [64]:
print(dataframe1.loc[:2,"age"])

0    24.0
1    36.0
2    56.0
Name: age, dtype: float64

In [65]:
print(dataframe1.loc[:1, "name":"note"])

    name   age   note
0    apo  24.0  888.0
1  yusuf  36.0  238.0

In [66]:
print(dataframe1.loc[:4, ["name","note"]])

     name     note
0     apo    888.0
1   yusuf    238.0
2    kaan     42.0
3  tayfun  87654.0
4    aliş      NaN

In [67]:
print(dataframe1.loc[::-1])

     name   age     note  yeni_future
4    aliş   NaN      NaN            5
3  tayfun  42.0  87654.0            4
2    kaan  56.0     42.0            3
1   yusuf  36.0    238.0            2
0     apo  24.0    888.0            1

In [68]:
print(dataframe1.loc[:,:"age"])

     name   age
0     apo  24.0
1   yusuf  36.0
2    kaan  56.0
3  tayfun  42.0
4    aliş   NaN

In [69]:
print(dataframe1.iloc[:,[3]])

   yeni_future
0            1
1            2
2            3
3            4
4            5

In [70]:
filtre1 = dataframe1.age>25                           
dataframe1["bool"]= filtre1
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  24.0  False
1  36.0   True
2  56.0   True
3  42.0   True
4   NaN  False

In [71]:
type(filtre1)

pandas.core.series.Series

In [72]:
filtrelenmis_data= dataframe1[filtre1] 
print(filtrelenmis_data)

     name   age     note  yeni_future  bool
1   yusuf  36.0    238.0            2  True
2    kaan  56.0     42.0            3  True
3  tayfun  42.0  87654.0            4  True

In [73]:
filtre2 = dataframe1.note>150
filtrelenmis_data2 = dataframe1[filtre2&filtre1] 
print(filtrelenmis_data2)

     name   age     note  yeni_future  bool
1   yusuf  36.0    238.0            2  True
3  tayfun  42.0  87654.0            4  True

In [74]:
dataframe1[dataframe1.age>35]

     name   age     note  yeni_future  bool
1   yusuf  36.0    238.0            2  True
2    kaan  56.0     42.0            3  True
3  tayfun  42.0  87654.0            4  True

In [75]:
import numpy as np
ortalama = dataframe1.note.mean()
print(ortalama)
ortlama_np= np.mean(dataframe1.note) 
print(ortlama_np)

22205.5
22205.5

In [76]:
dataframe1.dropna(inplace=True) 
dataframe1

     name   age     note  yeni_future   bool
0     apo  24.0    888.0            1  False
1   yusuf  36.0    238.0            2   True
2    kaan  56.0     42.0            3   True
3  tayfun  42.0  87654.0            4   True

In [77]:
print(dataframe1.note.mean()) 
dataframe1["ortalama"]= ["ortalamanın altında" if dataframe1.note.mean()>each else "ortalamanın üstünde" for each in dataframe1.note]
dataframe1

22205.5

     name   age     note  yeni_future   bool             ortalama
0     apo  24.0    888.0            1  False  ortalamanın altında
1   yusuf  36.0    238.0            2   True  ortalamanın altında
2    kaan  56.0     42.0            3   True  ortalamanın altında
3  tayfun  42.0  87654.0            4   True  ortalamanın üstünde

In [78]:
dataframe1.columns = [each.upper() for each in dataframe1.columns]
dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'YENI_FUTURE', 'BOOL', 'ORTALAMA'], dtype='object')

In [80]:
dataframe1.columns = [ each.split(" ")[0]+"_"+each.split(" ")[1] if len(each.split(" "))>1 else each for each in dataframe1.columns]
dataframe1

     NAME   AGE     NOTE  YENI_FUTURE   BOOL             ORTALAMA
0     apo  24.0    888.0            1  False  ortalamanın altında
1   yusuf  36.0    238.0            2   True  ortalamanın altında
2    kaan  56.0     42.0            3   True  ortalamanın altında
3  tayfun  42.0  87654.0            4   True  ortalamanın üstünde

In [81]:
data1 = dataframe1.head()     
data2 = dataframe1.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

     NAME   AGE     NOTE  YENI_FUTURE   BOOL             ORTALAMA
0     apo  24.0    888.0            1  False  ortalamanın altında
1   yusuf  36.0    238.0            2   True  ortalamanın altında
2    kaan  56.0     42.0            3   True  ortalamanın altında
3  tayfun  42.0  87654.0            4   True  ortalamanın üstünde
0     apo  24.0    888.0            1  False  ortalamanın altında
1   yusuf  36.0    238.0            2   True  ortalamanın altında
2    kaan  56.0     42.0            3   True  ortalamanın altında
3  tayfun  42.0  87654.0            4   True  ortalamanın üstünde

In [82]:
data_contact2 = pd.concat([data1,data2],axis=1) 
data_contact2

,NAME,AGE,NOTE,YENI_FUTURE,BOOL,ORTALAMA,NAME,AGE,NOTE,YENI_FUTURE,BOOL,ORTALAMA
0,apo,24.0,888.0,1,False,ortalamanın altında,apo,24.0,888.0,1,False,ortalamanın altında
1,yusuf,36.0,238.0,2,True,ortalamanın altında,yusuf,36.0,238.0,2,True,ortalamanın altında
2,kaan,56.0,42.0,3,True,ortalamanın altında,kaan,56.0,42.0,3,True,ortalamanın altında
3,tayfun,42.0,87654.0,4,True,ortalamanın üstünde,tayfun,42.0,87654.0,4,True,ortalamanın üstünde

In [83]:
dataframe1["buyuk_yas"] = [each*2 for each in dataframe1.AGE]
dataframe1

     NAME   AGE     NOTE  YENI_FUTURE   BOOL             ORTALAMA  buyuk_yas
0     apo  24.0    888.0            1  False  ortalamanın altında       48.0
1   yusuf  36.0    238.0            2   True  ortalamanın altında       72.0
2    kaan  56.0     42.0            3   True  ortalamanın altında      112.0
3  tayfun  42.0  87654.0            4   True  ortalamanın üstünde       84.0

In [85]:
def mlt(yas):
    return yas*2
dataframe1["apply_metodu"] = dataframe1.AGE.apply(mlt)
dataframe1

,NAME,AGE,NOTE,YENI_FUTURE,BOOL,ORTALAMA,buyuk_yas,apply_metodu
0,apo,24.0,888.0,1,False,ortalamanın altında,48.0,48.0
1,yusuf,36.0,238.0,2,True,ortalamanın altında,72.0,72.0
2,kaan,56.0,42.0,3,True,ortalamanın altında,112.0,112.0
3,tayfun,42.0,87654.0,4,True,ortalamanın üstünde,84.0,84.0